# Напишіть програму аналізу значень температури хворого за добу:
# визначте мінімальне і максимальне значення, середнє арифметичне. Заміри
# температури виробляються шість раз на добу і результати вводяться з клавіатури у
# масив T.
#licherep Artem
counter = 0
t = []
for i in range(6):
    t.append(float(input("input:")))
print(t)
for i in range(6):
    counter += t[i]
print("середнє арифметичне:", counter/6)
print("максимальне значення:", max(t))
print("мінімальне значення:", min(t))
