#Лінійний масив містить відомості про кількість опадів, що випали за
#кожен з 12 місяців одного року. Складіть програму, що визначає загальну кількість
#опадів протягом цього року, середньомісячну кількість опадів, кількість посушливих
#місяців (коли кількість опадів було менше 30 мм), найпосушливіший місяць року.
#licherep Artem

import numpy as np
a = np.array((15.5, 19.4, 46.5, 51.1, 49, 55.7, 69.5, 57.2, 34, 39.5, 27.9, 24.6))
year = 0
min_30 = 0
min_min = 0
for i in range(len(a)):
    year += a[i]
    if min(a) == a[i]:
        min_min = i
    elif a[i] < 30:
        min_30 += 1
print('Загальна:',year)
print('Середня:',year/len(a))
print('Посушливих:',min_30)
print('Найпосушливіший:',min_min+1)