# Перетин даху має форму півкола з радіусом R м. Сформувати таблицю,
# яка містить довжини опор, які встановлюються через кожні R / 5 м.а
# licherep artem
import math

r = int(input('Введіть радіус півкола - '))  # просимо ввести  радіус півкола
dov = []  # створюємо пустий список
for i in range(r // 5):
    dov.append(math.sqrt(r ** 2 - ((r / 5) * (4 - i)) ** 2))  # рахуваємо довжину опори(за т.Піфагора)
for i in range(len(dov) - 2, -1, -1):
    dov.append(dov[i])  # добавляємо наш елемент в список
print(dov)  # виводимо довжини опор
