
#У будинку, що складається з 30 квартир, переселити мешканців так, щоб
#мешканці першої квартири переїхали в тридцяту, з тридцятого - в першу, з другої - в 29
#і т.д., знайдіть кількість квартир, в яких проживає більше 5 осіб.
#licherep Artem
import random
c=list()
e=list()
g=0
for a in range(30):
    b=random.randint(1,7)#створюємо рандомний масиив
    c.append(b)
for d in range(29,-1,-1):#в іншу сторону
    e.append(c[d])#добабляємо елементи
print(c)#первичний
print(e)#кінечний

for f in range(30):
    if e[f]>=5:#квартири
        g+=1#в яких
print(g)#більше 5