#Відомість на зарплату представлена як дві таблиці. Одна містить
#прізвища працівників цеху, а друга - їх зарплату за поточний місяць. Знайдіть прізвище
#працівника, зарплата якого найменш відхиляється від середньої зарплати всіх
#працівників за поточний місяць. Знайдіть прізвища двох працівників з найбільшою
#заробітною платою. Видаліть з відомості на зарплату відомості про працівника,
#зарплата якого мінімальна.
#licherep Artem
a = ['aaa', 'bbb', 'ccc', 'ddd', 'eee', ]
b = [1234, 2345, 3456, 4567, 5678, ]
c = 0
g = 99999999999999999

for d in range(len(b)):
    c = c + b[d]  # сума елементів спочатку
e = c // len(b)  # среднж арифметичне

for f in range(len(b)):  # йдемо по масиву
    h = b[f] - e
    i = e - b[f]
    if b[f] >= e:  #якщо число більше середнього, то від числа віднімаємо середнє
        if h <= g:
            g = h  #а якщо воно менше минулого то воно приймає нове значення
    else:
        if i <= g:  #а якщо число менше середнього то від середнього віднімається число
            g = i
j = g + e

for k in range(len(b)):  # знаходимо це число в масиві
    try:
        if j == b[k]:  # щоб видалити з 2 масивів
            b.remove(b[k])
            a.remove(a[k])
    except:  #використовуєм трай ексепт тому що інакше видає помилку про вихід з діапазону
        break
print(a)
print(b)

l = b.copy()  # робимо поверхневу копію
for m in range(len(l) - 1):  # сотруємо за селекшіом
    n = m
    for o in range(m + 1, len(l)):
        if l[o] > l[n]:  # за зменшенням
            n = o
    l[m], l[n] = l[n], l[m]
p = l[:2]  # 2 крайніх елемента
r = l[len(l) - 1:]  # для найменшого
for q in range(len(b)):  # знаходимо найбільші елементи
    if b[q] == p[0] or b[q] == p[1]:
        print(f'{a[q]}  Вища')

for q in range(len(b)):  # видалюємо найменший
    try:  # с
        if b[q] == r[0]:
            b.remove(b[q])  #можно видалити і з двох сторін a.remove(a[q])
    except:
        break
print(a)
print(b)















